; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v7 ?v3)
             (pred_8 ?v6 ?v10)
             (pred_6 ?v7 ?v10)
             (pred_2 ?v13 ?v7 )
	     (pred_10 ?v7)
             (pred_5 ?v8)
             (pred_1 ?v6)
             (pred_7 ?v10)
             (pred_9 ?v7)
             (pred_4 ?v6)
             (pred_11 ?v7)
             (pred_3 ))



(:action op_1
:parameters (?v12 ?v11 ?v5 ?v4)
:precondition (and (pred_5 ?v12) (pred_5 ?v11) (pred_1 ?v5) (pred_7 ?v4)
          (pred_12 ?v12 ?v11) (pred_8 ?v5 ?v4)
                   (pred_6 ?v11 ?v4) (pred_10 ?v12) 
                   (pred_9 ?v11) (pred_4 ?v5))
:effect (and  (pred_11 ?v11) (not (pred_9 ?v11))))


(:action op_5
:parameters (?v12 ?v9)
:precondition (and (pred_5 ?v12) (pred_5 ?v9)
               (pred_10 ?v12) (pred_12 ?v12 ?v9) (pred_11 ?v9))
:effect (and (pred_10 ?v9) (not (pred_10 ?v12))))

(:action op_2
:parameters (?v12 ?v5)
:precondition (and (pred_5 ?v12) (pred_1 ?v5) 
                  (pred_10 ?v12) (pred_2 ?v5 ?v12) (pred_3 ))
:effect (and (pred_4 ?v5)
   (not (pred_2 ?v5 ?v12)) (not (pred_3 ))))


(:action op_4
:parameters (?v12 ?v2 ?v1)
:precondition (and (pred_5 ?v12) (pred_1 ?v2) (pred_1 ?v1)
                  (pred_10 ?v12) (pred_4 ?v1) (pred_2 ?v2 ?v12))
:effect (and (pred_4 ?v2) (pred_2 ?v1 ?v12)
        (not (pred_4 ?v1)) (not (pred_2 ?v2 ?v12))))

(:action op_3
:parameters (?v12 ?v5)
:precondition (and (pred_5 ?v12) (pred_1 ?v5) 
                  (pred_10 ?v12) (pred_4 ?v5))
:effect (and (pred_3 ) (pred_2 ?v5 ?v12) (not (pred_4 ?v5)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_20 obj_10 obj_04 obj_16 obj_07 obj_09 obj_06 obj_18 obj_26 obj_17 obj_14 obj_02 obj_29 obj_22 obj_28 obj_24 obj_05 obj_03 obj_27 obj_25 obj_19 obj_08 obj_15 obj_13
    obj_12 obj_21
    obj_30 obj_01 obj_23
    )

    (:init
       (pred_3)

       (pred_5 obj_11)
       (pred_5 obj_20)
       (pred_5 obj_10)
       (pred_5 obj_04)
       (pred_5 obj_16)
       (pred_5 obj_07)
       (pred_5 obj_09)
       (pred_5 obj_06)
       (pred_5 obj_18)
       (pred_5 obj_26)
       (pred_5 obj_17)
       (pred_5 obj_14)
       (pred_5 obj_02)
       (pred_5 obj_29)
       (pred_5 obj_22)
       (pred_5 obj_28)
       (pred_5 obj_24)
       (pred_5 obj_05)
       (pred_5 obj_03)
       (pred_5 obj_27)
       (pred_5 obj_25)
       (pred_5 obj_19)
       (pred_5 obj_08)
       (pred_5 obj_15)
       (pred_5 obj_13)
       (pred_7 obj_12)
       (pred_7 obj_21)
       (pred_1 obj_30)
       (pred_1 obj_01)
       (pred_1 obj_23)

       (pred_12 obj_11 obj_07)
       (pred_12 obj_11 obj_20)
       (pred_12 obj_20 obj_09)
       (pred_12 obj_20 obj_10)
       (pred_12 obj_20 obj_11)
       (pred_12 obj_10 obj_06)
       (pred_12 obj_10 obj_04)
       (pred_12 obj_10 obj_20)
       (pred_12 obj_04 obj_18)
       (pred_12 obj_04 obj_16)
       (pred_12 obj_04 obj_10)
       (pred_12 obj_16 obj_26)
       (pred_12 obj_16 obj_04)
       (pred_12 obj_07 obj_17)
       (pred_12 obj_07 obj_09)
       (pred_12 obj_07 obj_11)
       (pred_12 obj_09 obj_14)
       (pred_12 obj_09 obj_06)
       (pred_12 obj_09 obj_20)
       (pred_12 obj_09 obj_07)
       (pred_12 obj_06 obj_02)
       (pred_12 obj_06 obj_18)
       (pred_12 obj_06 obj_10)
       (pred_12 obj_06 obj_09)
       (pred_12 obj_18 obj_29)
       (pred_12 obj_18 obj_26)
       (pred_12 obj_18 obj_04)
       (pred_12 obj_18 obj_06)
       (pred_12 obj_26 obj_22)
       (pred_12 obj_26 obj_16)
       (pred_12 obj_26 obj_18)
       (pred_12 obj_17 obj_28)
       (pred_12 obj_17 obj_14)
       (pred_12 obj_17 obj_07)
       (pred_12 obj_14 obj_24)
       (pred_12 obj_14 obj_02)
       (pred_12 obj_14 obj_09)
       (pred_12 obj_14 obj_17)
       (pred_12 obj_02 obj_05)
       (pred_12 obj_02 obj_29)
       (pred_12 obj_02 obj_06)
       (pred_12 obj_02 obj_14)
       (pred_12 obj_29 obj_03)
       (pred_12 obj_29 obj_22)
       (pred_12 obj_29 obj_18)
       (pred_12 obj_29 obj_02)
       (pred_12 obj_22 obj_27)
       (pred_12 obj_22 obj_26)
       (pred_12 obj_22 obj_29)
       (pred_12 obj_28 obj_25)
       (pred_12 obj_28 obj_24)
       (pred_12 obj_28 obj_17)
       (pred_12 obj_24 obj_19)
       (pred_12 obj_24 obj_05)
       (pred_12 obj_24 obj_14)
       (pred_12 obj_24 obj_28)
       (pred_12 obj_05 obj_08)
       (pred_12 obj_05 obj_03)
       (pred_12 obj_05 obj_02)
       (pred_12 obj_05 obj_24)
       (pred_12 obj_03 obj_15)
       (pred_12 obj_03 obj_27)
       (pred_12 obj_03 obj_29)
       (pred_12 obj_03 obj_05)
       (pred_12 obj_27 obj_13)
       (pred_12 obj_27 obj_22)
       (pred_12 obj_27 obj_03)
       (pred_12 obj_25 obj_19)
       (pred_12 obj_25 obj_28)
       (pred_12 obj_19 obj_08)
       (pred_12 obj_19 obj_24)
       (pred_12 obj_19 obj_25)
       (pred_12 obj_08 obj_15)
       (pred_12 obj_08 obj_05)
       (pred_12 obj_08 obj_19)
       (pred_12 obj_15 obj_13)
       (pred_12 obj_15 obj_03)
       (pred_12 obj_15 obj_08)
       (pred_12 obj_13 obj_27)
       (pred_12 obj_13 obj_15)
       (pred_9 obj_26)
       (pred_9 obj_22)
       (pred_9 obj_06)
       (pred_6  obj_26 obj_12)
       (pred_6  obj_22 obj_21)
       (pred_6  obj_06 obj_12)
       (pred_11 obj_11)
       (pred_11 obj_20)
       (pred_11 obj_10)
       (pred_11 obj_04)
       (pred_11 obj_16)
       (pred_11 obj_07)
       (pred_11 obj_09)
       (pred_11 obj_18)
       (pred_11 obj_17)
       (pred_11 obj_14)
       (pred_11 obj_02)
       (pred_11 obj_29)
       (pred_11 obj_28)
       (pred_11 obj_24)
       (pred_11 obj_05)
       (pred_11 obj_03)
       (pred_11 obj_27)
       (pred_11 obj_25)
       (pred_11 obj_19)
       (pred_11 obj_08)
       (pred_11 obj_15)
       (pred_11 obj_13)

       (pred_8  obj_30 obj_12)
       (pred_8  obj_01 obj_21)
       (pred_8  obj_23 obj_21)
       (pred_2 obj_30 obj_13)
       (pred_2 obj_01 obj_20)
       (pred_2 obj_23 obj_07)
       (pred_10 obj_20)
    )

    (:goal (and
       (pred_2 obj_30 obj_10)
       (pred_2 obj_23 obj_11)
    ))
(:constraints
  (always (not (pred_10 obj_03)))
)
)

; plan
1. (op_2 obj_20 obj_01)
   deleted: (pred_2 obj_01 obj_20) (pred_3)
   added: (pred_4 obj_01)
   goals met: 0 of 2
2. (op_5 obj_20 obj_10)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_10)
   goals met: 0 of 2
3. (op_3 obj_10 obj_01)
   deleted: (pred_4 obj_01)
   added: (pred_3) (pred_2 obj_01 obj_10)
   goals met: 0 of 2
4. (op_5 obj_10 obj_20)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_20)
   goals met: 0 of 2
5. (op_5 obj_20 obj_11)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_11)
   goals met: 0 of 2
6. (op_5 obj_11 obj_07)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_07)
   goals met: 0 of 2
7. (op_2 obj_07 obj_23)
   deleted: (pred_2 obj_23 obj_07) (pred_3)
   added: (pred_4 obj_23)
   goals met: 0 of 2
8. (op_5 obj_07 obj_11)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_11)
   goals met: 0 of 2
9. (op_3 obj_11 obj_23)
   deleted: (pred_4 obj_23)
   added: (pred_3) (pred_2 obj_23 obj_11)
   goals met: 1 of 2
10. (op_5 obj_11 obj_20)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_20)
   goals met: 1 of 2
11. (op_5 obj_20 obj_09)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_09)
   goals met: 1 of 2
12. (op_5 obj_09 obj_14)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_14)
   goals met: 1 of 2
13. (op_5 obj_14 obj_24)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_24)
   goals met: 1 of 2
14. (op_5 obj_24 obj_05)
   deleted: (pred_10 obj_24)
   added: (pred_10 obj_05)
   goals met: 1 of 2
15. (op_5 obj_05 obj_08)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_08)
   goals met: 1 of 2
16. (op_5 obj_08 obj_15)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_15)
   goals met: 1 of 2
17. (op_5 obj_15 obj_13)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_13)
   goals met: 1 of 2
18. (op_2 obj_13 obj_30)
   deleted: (pred_2 obj_30 obj_13) (pred_3)
   added: (pred_4 obj_30)
   goals met: 1 of 2
19. (op_5 obj_13 obj_15)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_15)
   goals met: 1 of 2
20. (op_5 obj_15 obj_08)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_08)
   goals met: 1 of 2
21. (op_5 obj_08 obj_05)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_05)
   goals met: 1 of 2
22. (op_5 obj_05 obj_02)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_02)
   goals met: 1 of 2
23. (op_1 obj_02 obj_06 obj_30 obj_12)
   deleted: (pred_9 obj_06)
   added: (pred_11 obj_06)
   goals met: 1 of 2
24. (op_5 obj_02 obj_06)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_06)
   goals met: 1 of 2
25. (op_5 obj_06 obj_10)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_10)
   goals met: 1 of 2
26. (op_4 obj_10 obj_01 obj_30)
   deleted: (pred_4 obj_30) (pred_2 obj_01 obj_10)
   added: (pred_4 obj_01) (pred_2 obj_30 obj_10)
   goals met: 2 of 2
